tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/versions"

# binaries
brew "gcc"
brew "aspell"
brew "autojump"
brew "git"
brew "gnupg"
brew "gnuplot", args: ["with-x11"]
brew "gpg-agent"
brew "gradle"
brew "groovy"
brew "hub"
brew "imagemagick"
brew "jq"
brew "m-cli"
brew "make"
brew "maven"
brew "mysql@5.5", restart_service: true
brew "node@8", link: true
brew "nvm"
brew "octave"
brew "pinentry-mac"
brew "pssh"
brew "pup"
brew "python"
brew "the_silver_searcher"
brew "tree"
brew "zplug"
brew "zsh"
brew "zsh-completions"
brew "wget"

# apps
cask "alfred"
cask "bartender"
cask "bowtie"
cask "caffeine"
cask "datagrip"
cask "docker"
cask "dropbox"
cask "google-chrome"
cask "gpg-suite"
cask "intellij-idea"
cask "kap"
cask "mactex"
cask "postman"
cask "sequel-pro"
cask "spotify"
cask "sublime-text"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "xquartz"
